/***********************************************************************************
* 版权所有(C)2020, 广州海格通信集团股份有限公司.
* 项目代号:    S023
* 文件名称:    freeRTOS_user.h
* 运行平台:    GCC
* 编译环境:    GCC编译器
* 程序语言:    C
* 作       者:    张问谦
* 内容摘要:    freeRTOS用户接口文件
* 完成日期:    2020年11月
************************************************************************************/

#ifndef FREERTOS_FREERTOS_USER_H_
#define FREERTOS_FREERTOS_USER_H_

/***********************************************************************************
 *                                 外 部 函 数 申 明
 ***********************************************************************************/
void prvSetupHardware( void );

#endif /* FREERTOS_FREERTOS_USER_H_ */
